particle-iot/device-os/hal/src/stm32f2xx/core_hal_stm32f2xx.c
/* Private function prototypes -----------------------------------------------*/
extern uint32_t HAL_Interrupts_Pin_IRQn(pin_t pin);

void (*HAL_TIM1_Handler)(void);
void (*HAL_TIM3_Handler)(void);
void (*HAL_TIM4_Handler)(void);
void (*HAL_TIM5_Handler)(void);
void (*HAL_TIM8_Handler)(void);

//HAL Interrupt Handlers defined in xxx_hal.c files
void HAL_CAN1_TX_Handler(void) __attribute__ ((weak));
void HAL_CAN1_RX0_Handler(void) __attribute__ ((weak));
void HAL_CAN1_RX1_Handler(void) __attribute__ ((weak));
void HAL_CAN1_SCE_Handler(void) __attribute__ ((weak));
void HAL_CAN2_TX_Handler(void) __attribute__ ((weak));
void HAL_CAN2_RX0_Handler(void) __attribute__ ((weak));
void HAL_CAN2_RX1_Handler(void) __attribute__ ((weak));
void HAL_CAN2_SCE_Handler(void) __attribute__ ((weak));

/* Private functions ---------------------------------------------------------*/

static void Init_Last_Reset_Info()
{
    if (HAL_Core_System_Reset_FlagSet(SOFTWARE_RESET))
    {
        // Load reset info from backup registers
        last_reset_info.reason = RTC_ReadBackupRegister(RTC_BKP_DR2);
        last_reset_info.data = RTC_ReadBackupRegister(RTC_BKP_DR3);
        // Clear backup registers
        RTC_WriteBackupRegister(RTC_BKP_DR2, 0);
        RTC_WriteBackupRegister(RTC_BKP_DR3, 0);
    }
    else // Hardware reset
    {
        if (HAL_Core_System_Reset_FlagSet(WATCHDOG_RESET))
        {
            last_reset_info.reason = RESET_REASON_WATCHDOG;
        }
        else if (HAL_Core_System_Reset_FlagSet(POWER_MANAGEMENT_RESET))
        {
            last_reset_info.reason = RESET_REASON_POWER_MANAGEMENT; // Reset generated when entering standby mode (nRST_STDBY: 0)
        }
        else if (HAL_Core_System_Reset_FlagSet(POWER_DOWN_RESET))
        {
            last_reset_info.reason = RESET_REASON_POWER_DOWN;
        }
        else if (HAL_Core_System_Reset_FlagSet(POWER_BROWNOUT_RESET))
        {
            last_reset_info.reason = RESET_REASON_POWER_BROWNOUT;
        }
        else if (HAL_Core_System_Reset_FlagSet(PIN_RESET)) // Pin reset flag should be checked in the last place
        {
            last_reset_info.reason = RESET_REASON_PIN_RESET;
        }
        else if (PWR_GetFlagStatus(PWR_FLAG_SB) != RESET) // Check if MCU was in standby mode
        {
            last_reset_info.reason = RESET_REASON_POWER_MANAGEMENT; // Reset generated when exiting standby mode (nRST_STDBY: 1)
        }
        else
        {
            last_reset_info.reason = RESET_REASON_UNKNOWN;
        }
        last_reset_info.data = 0; // Not used
    }
    // Note: RCC reset flags should be cleared, see HAL_Core_Init()
}

static int Write_Feature_Flag(uint32_t flag, bool value, bool *prev_value)
{
    if (HAL_IsISR()) {
        return -1; // DCT cannot be accessed from an ISR
    }
    uint32_t flags = 0;
    int result = dct_read_app_data_copy(DCT_FEATURE_FLAGS_OFFSET, &flags, sizeof(flags));
    if (result != 0) {
        return result;
    }
    const bool cur_value = flags & flag;
    if (prev_value) {
        *prev_value = cur_value;
    }
    if (cur_value != value) {
        if (value) {
            flags |= flag;
        } else {
            flags &= ~flag;
        }
        result = dct_write_app_data(&flags, DCT_FEATURE_FLAGS_OFFSET, 4);
        if (result != 0) {
            return result;
        }
    }
    feature_flags = flags;
    feature_flags_loaded = true;
    return 0;
}

static int Read_Feature_Flag(uint32_t flag, bool* value)
{
    uint32_t flags = 0;
    if (!feature_flags_loaded) {
        if (HAL_IsISR()) {
            return -1; // DCT cannot be accessed from an ISR
        }
        const int result = dct_read_app_data_copy(DCT_FEATURE_FLAGS_OFFSET, &flags, sizeof(flags));
        if (result != 0) {
            return result;
        }
        feature_flags = flags;
        feature_flags_loaded = true;
    } else {
        flags = feature_flags;
    }
    *value = flags & flag;
    return 0;
}

/* Extern variables ----------------------------------------------------------*/

volatile uint8_t rtos_started = 0;

/*******************************************************************************
 * Function Name  : HAL_Core_Config.
 * Description    : Called in startup routine, before calling C++ constructors.
 * Input          : None.
 * Output         : None.
 * Return         : None.
 *******************************************************************************/
void HAL_Core_Config(void)
{
    DECLARE_SYS_HEALTH(ENTERED_SparkCoreConfig);

#ifdef DFU_BUILD_ENABLE
    //Currently this is done through WICED library API so commented.
    //NVIC_SetVectorTable(NVIC_VectTab_FLASH, 0x20000);
    USE_SYSTEM_FLAGS = 1;
#endif

    Set_System();

    RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_BKPSRAM, ENABLE);

    /* Disable WKP pin */
    PWR_WakeUpPinCmd(DISABLE);

    //Wiring pins default to inputs
    for (pin_t pin = 0; pin < TOTAL_ESSENTIAL_PINS; pin++) {
#if defined(USE_SWD_JTAG) || defined(USE_SWD)
        if (pin >= D3 && pin <= D7) { // JTAG pins
            continue;
        }
#endif
        HAL_Pin_Mode(pin, INPUT);
    }

#if HAS_EXTRA_PINS
    for (pin_t pin = FIRST_EXTRA_PIN; pin <= LAST_EXTRA_PIN; pin++) {
        HAL_Pin_Mode(pin, INPUT);
    }
#endif

#if PLATFORM_ID == PLATFORM_P1
    if (isWiFiPowersaveClockDisabled()) {
        HAL_Pin_Mode(30, INPUT); // Wi-Fi Powersave clock is disabled, default to INPUT
    }
#endif

    HAL_Core_Config_systick_configuration();

    HAL_RTC_Configuration();

    HAL_RNG_Configuration();

#ifdef DFU_BUILD_ENABLE
    Load_SystemFlags();
#endif

    // TODO: Use current LED theme
    if (HAL_Feature_Get(FEATURE_LED_OVERRIDDEN)) {
        // Just in case
        LED_Off(LED_RGB);
    } else {
        LED_SetRGBColor(RGB_COLOR_WHITE);
        LED_On(LED_RGB);
    }

    // override the WICED interrupts, specifically SysTick - there is a bug
    // where WICED isn't ready for a SysTick until after main() has been called to
    // fully intialize the RTOS.
    HAL_Core_Setup_override_interrupts();

#ifdef HAS_SERIAL_FLASH
    //Initialize Serial Flash
    sFLASH_Init();
#else
    FLASH_AddToFactoryResetModuleSlot(FLASH_INTERNAL, INTERNAL_FLASH_FAC_ADDRESS,
                                      FLASH_INTERNAL, USER_FIRMWARE_IMAGE_LOCATION, FIRMWARE_IMAGE_SIZE,
                                      FACTORY_RESET_MODULE_FUNCTION, MODULE_VERIFY_CRC|MODULE_VERIFY_FUNCTION|MODULE_VERIFY_DESTINATION_IS_START_ADDRESS); //true to verify the CRC during copy also
#endif
}

