particle-iot/device-os/hal/src/stm32f2xx/core_hal_stm32f2xx.c
    HAL_System_Interrupt_Trigger(SysInterrupt_TIM2_IRQ, NULL);
    uint8_t result =
    handle_timer(TIM2, TIM_IT_CC1, SysInterrupt_TIM2_Compare1) ||
    handle_timer(TIM2, TIM_IT_CC2, SysInterrupt_TIM2_Compare2) ||
    handle_timer(TIM2, TIM_IT_CC3, SysInterrupt_TIM2_Compare3) ||
    handle_timer(TIM2, TIM_IT_CC4, SysInterrupt_TIM2_Compare4) ||
    handle_timer(TIM2, TIM_IT_Update, SysInterrupt_TIM2_Update) ||
    handle_timer(TIM2, TIM_IT_Trigger, SysInterrupt_TIM2_Trigger);
    UNUSED(result);
}

/**
 * @brief  This function handles TIM3_IRQ Handler.
 * @param  None
 * @retval None
 */
void TIM3_irq(void)
{
    if(NULL != HAL_TIM3_Handler)
    {
        HAL_TIM3_Handler();
    }

    HAL_System_Interrupt_Trigger(SysInterrupt_TIM3_IRQ, NULL);
    uint8_t result =
    handle_timer(TIM3, TIM_IT_CC1, SysInterrupt_TIM3_Compare1) ||
    handle_timer(TIM3, TIM_IT_CC2, SysInterrupt_TIM3_Compare2) ||
    handle_timer(TIM3, TIM_IT_CC3, SysInterrupt_TIM3_Compare3) ||
    handle_timer(TIM3, TIM_IT_CC4, SysInterrupt_TIM3_Compare4) ||
    handle_timer(TIM3, TIM_IT_Update, SysInterrupt_TIM3_Update) ||
    handle_timer(TIM3, TIM_IT_Trigger, SysInterrupt_TIM3_Trigger);
    UNUSED(result);
}

/**
 * @brief  This function handles TIM4_IRQ Handler.
 * @param  None
 * @retval None
 */
void TIM4_irq(void)
{
    if(NULL != HAL_TIM4_Handler)
    {
        HAL_TIM4_Handler();
    }

    HAL_System_Interrupt_Trigger(SysInterrupt_TIM4_IRQ, NULL);
    uint8_t result =
    handle_timer(TIM4, TIM_IT_CC1, SysInterrupt_TIM4_Compare1) ||
    handle_timer(TIM4, TIM_IT_CC2, SysInterrupt_TIM4_Compare2) ||
    handle_timer(TIM4, TIM_IT_CC3, SysInterrupt_TIM4_Compare3) ||
    handle_timer(TIM4, TIM_IT_CC4, SysInterrupt_TIM4_Compare4) ||
    handle_timer(TIM4, TIM_IT_Update, SysInterrupt_TIM4_Update) ||
    handle_timer(TIM4, TIM_IT_Trigger, SysInterrupt_TIM4_Trigger);
    UNUSED(result);

}

/**
 * @brief  This function handles TIM5_IRQ Handler.
 * @param  None
 * @retval None
 */
void TIM5_irq(void)
{
    if(NULL != HAL_TIM5_Handler)
    {
        HAL_TIM5_Handler();
    }

    HAL_System_Interrupt_Trigger(SysInterrupt_TIM5_IRQ, NULL);
    uint8_t result =
    handle_timer(TIM5, TIM_IT_CC1, SysInterrupt_TIM5_Compare1) ||
    handle_timer(TIM5, TIM_IT_CC2, SysInterrupt_TIM5_Compare2) ||
    handle_timer(TIM5, TIM_IT_CC3, SysInterrupt_TIM5_Compare3) ||
    handle_timer(TIM5, TIM_IT_CC4, SysInterrupt_TIM5_Compare4) ||
    handle_timer(TIM5, TIM_IT_Update, SysInterrupt_TIM5_Update) ||
    handle_timer(TIM5, TIM_IT_Trigger, SysInterrupt_TIM5_Trigger);
    UNUSED(result);
}

void TIM6_DAC_irq(void)
{
    HAL_System_Interrupt_Trigger(SysInterrupt_TIM6_DAC_IRQ, NULL);
    handle_timer(TIM6, TIM_IT_Update, SysInterrupt_TIM6_Update);
}

void TIM7_override(void)
{
    HAL_System_Interrupt_Trigger(SysInterrupt_TIM7_IRQ, NULL);
    handle_timer(TIM7, TIM_IT_Update, SysInterrupt_TIM7_Update);
}

void TIM8_BRK_TIM12_irq(void)
{

    HAL_System_Interrupt_Trigger(SysInterrupt_TIM8_BRK_TIM12_IRQ, NULL);

    uint8_t result =
    handle_timer(TIM8, TIM_IT_Break, SysInterrupt_TIM8_Break) ||
    handle_timer(TIM12, TIM_IT_CC1, SysInterrupt_TIM12_Compare1) ||
    handle_timer(TIM12, TIM_IT_CC2, SysInterrupt_TIM12_Compare2) ||
    handle_timer(TIM12, TIM_IT_Update, SysInterrupt_TIM12_Update) ||
    handle_timer(TIM12, TIM_IT_Trigger, SysInterrupt_TIM12_Trigger);
    UNUSED(result);
}

void TIM8_UP_TIM13_irq(void)
{
    HAL_System_Interrupt_Trigger(SysInterrupt_TIM8_UP_TIM13_IRQ, NULL);

    uint8_t result =
    handle_timer(TIM8, TIM_IT_Update, SysInterrupt_TIM8_Update) ||
    handle_timer(TIM13, TIM_IT_CC1, SysInterrupt_TIM13_Compare) ||
    handle_timer(TIM13, TIM_IT_Update, SysInterrupt_TIM13_Update);
    UNUSED(result);
}

void TIM8_TRG_COM_TIM14_irq(void)
{
    HAL_System_Interrupt_Trigger(SysInterrupt_TIM8_TRG_COM_TIM14_IRQ, NULL);

    uint8_t result =
    handle_timer(TIM8, TIM_IT_Trigger, SysInterrupt_TIM8_Trigger) ||
    handle_timer(TIM14, TIM_IT_COM, SysInterrupt_TIM14_COM) ||
    handle_timer(TIM14, TIM_IT_CC1, SysInterrupt_TIM14_Compare);
    handle_timer(TIM14, TIM_IT_Update, SysInterrupt_TIM14_Update);
    UNUSED(result);
}

void TIM8_CC_irq(void)
{
#if PLATFORM_ID == PLATFORM_ELECTRON_PRODUCTION // Electron
    if(NULL != HAL_TIM8_Handler)
    {
        HAL_TIM8_Handler();
    }
#endif

    HAL_System_Interrupt_Trigger(SysInterrupt_TIM8_IRQ, NULL);

    uint8_t result =
    handle_timer(TIM8, TIM_IT_CC1, SysInterrupt_TIM8_Compare1) ||
    handle_timer(TIM8, TIM_IT_CC2, SysInterrupt_TIM8_Compare2) ||
    handle_timer(TIM8, TIM_IT_CC3, SysInterrupt_TIM8_Compare3) ||
    handle_timer(TIM8, TIM_IT_CC4, SysInterrupt_TIM8_Compare4);
    UNUSED(result);
}

void TIM1_BRK_TIM9_irq(void)
{
    HAL_System_Interrupt_Trigger(SysInterrupt_TIM1_BRK_TIM9_IRQ, NULL);

    uint8_t result =
    handle_timer(TIM1, TIM_IT_Break, SysInterrupt_TIM1_Break) ||
    handle_timer(TIM9, TIM_IT_CC1, SysInterrupt_TIM9_Compare1) ||
    handle_timer(TIM9, TIM_IT_CC2, SysInterrupt_TIM9_Compare2) ||
    handle_timer(TIM9, TIM_IT_Update, SysInterrupt_TIM9_Update) ||
    handle_timer(TIM9, TIM_IT_Trigger, SysInterrupt_TIM9_Trigger);
    UNUSED(result);
}

void TIM1_UP_TIM10_irq(void)
{
    HAL_System_Interrupt_Trigger(SysInterrupt_TIM1_UP_TIM10_IRQ, NULL);

    uint8_t result =
    handle_timer(TIM1, TIM_IT_Update, SysInterrupt_TIM1_Update) ||
    handle_timer(TIM10, TIM_IT_CC1, SysInterrupt_TIM10_Compare) ||
    handle_timer(TIM10, TIM_IT_Update, SysInterrupt_TIM10_Update);
    UNUSED(result);
}

void TIM1_TRG_COM_TIM11_irq(void)
{
    HAL_System_Interrupt_Trigger(SysInterrupt_TIM1_TRG_COM_TIM11_IRQ, NULL);

    uint8_t result =
    handle_timer(TIM1, TIM_IT_Trigger, SysInterrupt_TIM1_Trigger) ||
    handle_timer(TIM1, TIM_IT_COM, SysInterrupt_TIM1_COM) ||
    handle_timer(TIM11, TIM_IT_CC1, SysInterrupt_TIM11_Compare) ||
    handle_timer(TIM11, TIM_IT_Update, SysInterrupt_TIM11_Update);
    UNUSED(result);
}

void CAN1_TX_irq()
{
    if(NULL != HAL_CAN1_TX_Handler)
    {
        HAL_CAN1_TX_Handler();
    }
    HAL_System_Interrupt_Trigger(SysInterrupt_CAN1_TX_IRQ, NULL);
}

void CAN1_RX0_irq()
{
    if(NULL != HAL_CAN1_RX0_Handler)
    {
        HAL_CAN1_RX0_Handler();
    }
    HAL_System_Interrupt_Trigger(SysInterrupt_CAN1_RX0_IRQ, NULL);
}

void CAN1_RX1_irq()
{
    if(NULL != HAL_CAN1_RX1_Handler)
    {
        HAL_CAN1_RX1_Handler();
    }
    HAL_System_Interrupt_Trigger(SysInterrupt_CAN1_RX1_IRQ, NULL);
}

void CAN1_SCE_irq()
{
    if(NULL != HAL_CAN1_SCE_Handler)
    {
        HAL_CAN1_SCE_Handler();
    }
    HAL_System_Interrupt_Trigger(SysInterrupt_CAN1_SCE_IRQ, NULL);
}

void CAN2_TX_irq()
{
    if(NULL != HAL_CAN2_TX_Handler)
    {
        HAL_CAN2_TX_Handler();
    }
    HAL_System_Interrupt_Trigger(SysInterrupt_CAN2_TX_IRQ, NULL);
}

