particle-iot/device-os/hal/src/stm32f2xx/core_hal_stm32f2xx.c
void CAN2_RX0_irq()
{
    if(NULL != HAL_CAN2_RX0_Handler)
    {
        HAL_CAN2_RX0_Handler();
    }
    HAL_System_Interrupt_Trigger(SysInterrupt_CAN2_RX0_IRQ, NULL);
}

void CAN2_RX1_irq()
{
    if(NULL != HAL_CAN2_RX1_Handler)
    {
        HAL_CAN2_RX1_Handler();
    }
    HAL_System_Interrupt_Trigger(SysInterrupt_CAN2_RX1_IRQ, NULL);
}

void CAN2_SCE_irq()
{
    if(NULL != HAL_CAN2_SCE_Handler)
    {
        HAL_CAN2_SCE_Handler();
    }
    HAL_System_Interrupt_Trigger(SysInterrupt_CAN2_SCE_IRQ, NULL);
}

void HAL_Bootloader_Lock(bool lock)
{
    if (lock)
        FLASH_WriteProtection_Enable(BOOTLOADER_FLASH_PAGES);
    else
        FLASH_WriteProtection_Disable(BOOTLOADER_FLASH_PAGES);
}

static inline bool Is_System_Reset_Flag_Set(uint8_t flag)
{
    return SYSTEM_FLAG(RCC_CSR_SysFlag) & ((uint32_t)1 << (flag & 0x1f));
}

bool HAL_Core_System_Reset_FlagSet(RESET_TypeDef resetType)
{
    switch(resetType)
    {
    case PIN_RESET:
        return Is_System_Reset_Flag_Set(RCC_FLAG_PINRST);
    case SOFTWARE_RESET:
        return Is_System_Reset_Flag_Set(RCC_FLAG_SFTRST);
    case WATCHDOG_RESET:
        return Is_System_Reset_Flag_Set(RCC_FLAG_IWDGRST) || Is_System_Reset_Flag_Set(RCC_FLAG_WWDGRST);
    case POWER_MANAGEMENT_RESET:
        return Is_System_Reset_Flag_Set(RCC_FLAG_LPWRRST);
    case POWER_DOWN_RESET:
        return Is_System_Reset_Flag_Set(RCC_FLAG_PORRST);
    case POWER_BROWNOUT_RESET:
        return Is_System_Reset_Flag_Set(RCC_FLAG_BORRST);
    default:
        return false;
    }
}

unsigned HAL_Core_System_Clock(HAL_SystemClock clock, void* reserved)
{
    return SystemCoreClock;
}

extern size_t pvPortLargestFreeBlock();

uint32_t HAL_Core_Runtime_Info(runtime_info_t* info, void* reserved)
{
    struct mallinfo heapinfo = mallinfo();
    // fordblks  The total number of bytes in free blocks.
    info->freeheap = heapinfo.fordblks;
    if (offsetof(runtime_info_t, total_init_heap) + sizeof(info->total_init_heap) <= info->size) {
        info->total_init_heap = (uint32_t)(&link_heap_location_end - &link_heap_location);
    }

    if (offsetof(runtime_info_t, total_heap) + sizeof(info->total_heap) <= info->size) {
        info->total_heap = heapinfo.arena;
    }

    if (offsetof(runtime_info_t, max_used_heap) + sizeof(info->max_used_heap) <= info->size) {
        info->max_used_heap = heapinfo.usmblks;
    }

    if (offsetof(runtime_info_t, user_static_ram) + sizeof(info->user_static_ram) <= info->size) {
        info->user_static_ram = info->total_init_heap - info->total_heap;
    }

    if (offsetof(runtime_info_t, largest_free_block_heap) + sizeof(info->largest_free_block_heap) <= info->size) {
    		info->largest_free_block_heap = pvPortLargestFreeBlock();
    }

    return 0;
}

void vApplicationMallocFailedHook(size_t xWantedSize)
{
	hal_notify_event(HAL_EVENT_OUT_OF_MEMORY, xWantedSize, 0);
}

int HAL_Feature_Set(HAL_Feature feature, bool enabled)
{
    switch (feature)
    {
        case FEATURE_RETAINED_MEMORY:
        {
            FunctionalState state = enabled ? ENABLE : DISABLE;
            // Switch on backup SRAM clock
            // Switch on backup power regulator, so that it survives the deep sleep mode,
            // software and hardware reset. Power must be supplied to VIN or VBAT to retain SRAM values.
            PWR_BackupRegulatorCmd(state);
            // Wait until backup power regulator is ready, should be fairly instantaneous... but timeout in 10ms.
            if (state == ENABLE) {
                system_tick_t start = HAL_Timer_Get_Milli_Seconds();
                while (PWR_GetFlagStatus(PWR_FLAG_BRR) == RESET) {
                    if (HAL_Timer_Get_Milli_Seconds() - start > 10UL) {
                        return -2;
                    }
                };
            }
            return 0;
        }
        case FEATURE_RESET_INFO:
        {
            return Write_Feature_Flag(FEATURE_FLAG_RESET_INFO, enabled, NULL);
        }

#if PLATFORM_ID == PLATFORM_P1
        case FEATURE_WIFI_POWERSAVE_CLOCK:
        {
            wwd_set_wlan_sleep_clock_enabled(enabled);
            uint8_t current = 0;
            dct_read_app_data_copy(DCT_RADIO_FLAGS_OFFSET, &current, sizeof(current));
            current &= 0xFC;
            if (!enabled) {
                current |= 2;   // 0bxxxxxx10 to disable the clock, any other value to enable it.
            }
            dct_write_app_data(&current, DCT_RADIO_FLAGS_OFFSET, 1);
            return 0;
        }
#endif
#if HAL_PLATFORM_CLOUD_UDP
        case FEATURE_CLOUD_UDP: {
            const uint8_t data = (enabled ? 0xff : 0x00);
            return dct_write_app_data(&data, DCT_CLOUD_TRANSPORT_OFFSET, sizeof(data));
        }
#endif // HAL_PLATFORM_CLOUD_UDP
        case FEATURE_LED_OVERRIDDEN: {
            // Inverted logic for this bit specifically
            return Write_Feature_Flag(FEATURE_FLAG_LED_OVERRIDDEN, !enabled, NULL);
        }
    }
    return -1;
}

bool HAL_Feature_Get(HAL_Feature feature)
{
    switch (feature)
    {
        // Warm Start: active when resuming from Standby mode (deep sleep)
        case FEATURE_WARM_START:
        {
            return (PWR_GetFlagStatus(PWR_FLAG_SB) != RESET);
        }
        // Retained Memory: active when backup regulator is enabled
        case FEATURE_RETAINED_MEMORY:
        {
            return (PWR_GetFlagStatus(PWR_FLAG_BRR) != RESET);
        }

        case FEATURE_CLOUD_UDP:
        {
        		uint8_t value = false;
#if HAL_PLATFORM_CLOUD_UDP
        		dct_read_app_data_copy(DCT_CLOUD_TRANSPORT_OFFSET, &value, sizeof(value));
        		value = value==0xFF;		// default is to use UDP
#endif
        		return value;
        }
        case FEATURE_RESET_INFO:
        {
            bool value = false;
            return (Read_Feature_Flag(FEATURE_FLAG_RESET_INFO, &value) == 0) ? value : false;
        }
        case FEATURE_LED_OVERRIDDEN: {
            bool value = false;
            if (Read_Feature_Flag(FEATURE_FLAG_LED_OVERRIDDEN, &value) == 0) {
                // Inverted logic for this bit specifically
                value = !value;
            }
            return value;
        }
    }
    return false;
}

void HAL_Core_Mode_Button_Mirror_Pressed(void* param) {
    Handle_Mode_Button_EXTI_irq(BUTTON1_MIRROR);
}

