particle-iot/device-os/hal/src/stm32f2xx/core_hal_stm32f2xx.c
static void BUTTON_Mirror_Init() {
    if (HAL_Buttons[BUTTON1_MIRROR].port) {
        PinMode pinMode = INPUT_PULLUP;
        switch(HAL_Buttons[BUTTON1_MIRROR].interrupt_mode)
        {
        case RISING:
            pinMode = INPUT_PULLDOWN;
            break;
        case FALLING:
            pinMode = INPUT_PULLUP;
            break;
        }

        int32_t state = HAL_disable_irq();
        HAL_Pin_Mode(HAL_Buttons[BUTTON1_MIRROR].hal_pin, pinMode);
        HAL_Interrupts_Attach(HAL_Buttons[BUTTON1_MIRROR].hal_pin, HAL_Core_Mode_Button_Mirror_Pressed, NULL, HAL_Buttons[BUTTON1_MIRROR].interrupt_mode, NULL);
        if (HAL_Buttons[BUTTON1_MIRROR].exti_line == HAL_Buttons[BUTTON1].exti_line) {
            HAL_Buttons[BUTTON1].exti_port_source = HAL_Buttons[BUTTON1_MIRROR].exti_port_source;
            HAL_Buttons[BUTTON1].exti_pin_source = HAL_Buttons[BUTTON1_MIRROR].exti_pin_source;
            HAL_Buttons[BUTTON1].port = HAL_Buttons[BUTTON1_MIRROR].port;
        }
        HAL_enable_irq(state);
    }
}

static void BUTTON_Mirror_Persist(button_config_t* conf) {
    button_config_t saved_config;
    dct_read_app_data_copy(DCT_MODE_BUTTON_MIRROR_OFFSET, &saved_config, sizeof(saved_config));

    if (conf) {
        if (saved_config.active == 0xFF || memcmp((void*)conf, (void*)&saved_config, sizeof(button_config_t)))
        {
            dct_write_app_data((void*)conf, DCT_MODE_BUTTON_MIRROR_OFFSET, sizeof(button_config_t));
        }
    } else {
        if (saved_config.active != 0xFF) {
            memset((void*)&saved_config, 0xff, sizeof(button_config_t));
            dct_write_app_data((void*)&saved_config, DCT_MODE_BUTTON_MIRROR_OFFSET, sizeof(button_config_t));
        }
    }
}

void HAL_Core_Button_Mirror_Pin_Disable(uint8_t bootloader, uint8_t button, void* reserved) {
    (void)button; // unused
    int32_t state = HAL_disable_irq();
    if (HAL_Buttons[BUTTON1_MIRROR].port) {
        HAL_Interrupts_Detach_Ext(HAL_Buttons[BUTTON1_MIRROR].hal_pin, 1, NULL);
        HAL_Buttons[BUTTON1_MIRROR].active = 0;
        HAL_Buttons[BUTTON1_MIRROR].port = 0;
    }
    HAL_enable_irq(state);

    if (bootloader) {
        BUTTON_Mirror_Persist(NULL);
    }
}

static inline uint32_t Gpio_Peripheral_To_Port_Source(GPIO_TypeDef* gpio)
{
    switch((uint32_t)gpio) {
        case (uint32_t)GPIOA:
            return 0;
        case (uint32_t)GPIOB:
            return 1;
        case (uint32_t)GPIOC:
            return 2;
        case (uint32_t)GPIOD:
            return 3;
    }

    return 0;
}

static inline uint32_t Gpio_Peripheral_To_Clk(GPIO_TypeDef* gpio) {
    switch((uint32_t)gpio) {
        case (uint32_t)GPIOA:
            return RCC_AHB1Periph_GPIOA;
        case (uint32_t)GPIOB:
            return RCC_AHB1Periph_GPIOB;
        case (uint32_t)GPIOC:
            return RCC_AHB1Periph_GPIOC;
        case (uint32_t)GPIOD:
            return RCC_AHB1Periph_GPIOD;
    }

    return 0;
}

static inline uint32_t Tim_Peripheral_To_Af(TIM_TypeDef* tim) {
    switch((uint32_t)tim) {
        case (uint32_t)TIM1:
            return GPIO_AF_TIM1;
        case (uint32_t)TIM2:
            return GPIO_AF_TIM2;
        case (uint32_t)TIM3:
            return GPIO_AF_TIM3;
        case (uint32_t)TIM4:
            return GPIO_AF_TIM4;
        case (uint32_t)TIM5:
            return GPIO_AF_TIM5;
#if PLATFORM_ID == PLATFORM_ELECTRON_PRODUCTION
        case (uint32_t)TIM8:
            return GPIO_AF_TIM8;
#endif // PLATFORM_ID == PLATFORM_ELECTRON_PRODUCTION
    }

    return 0;
}

void HAL_Core_Button_Mirror_Pin(uint16_t pin, InterruptMode mode, uint8_t bootloader, uint8_t button, void *reserved) {
    (void)button; // unused
    Hal_Pin_Info* pinmap = HAL_Pin_Map();
    if (pin > TOTAL_PINS)
        return;

    if (mode != RISING && mode != FALLING)
        return;

    uint8_t gpio_port_source = Gpio_Peripheral_To_Port_Source(pinmap[pin].gpio_peripheral);
    uint32_t gpio_clk = Gpio_Peripheral_To_Clk(pinmap[pin].gpio_peripheral);

    button_config_t conf = {
        .port = pinmap[pin].gpio_peripheral,
        .pin = pinmap[pin].gpio_pin,
        .hal_pin = pin,
        .debounce_time = 0,
        .interrupt_mode = mode,

        .exti_line = pinmap[pin].gpio_pin,
        .exti_pin_source = pinmap[pin].gpio_pin_source,
        .exti_port_source = gpio_port_source,
        .exti_trigger = mode == RISING ? EXTI_Trigger_Rising : EXTI_Trigger_Falling
    };

    HAL_Buttons[BUTTON1_MIRROR] = conf;

    BUTTON_Mirror_Init();

    if (pinmap[pin].gpio_pin == HAL_Buttons[BUTTON1].pin) {
        LOG(WARN, "Pin %d shares the same EXTI as SETUP/MODE button", pin);
        BUTTON_Mirror_Persist(NULL);
        return;
    }

    if (!bootloader) {
        BUTTON_Mirror_Persist(NULL);
        return;
    }

    // Construct button_config_t for bootloader
    button_config_t bootloader_conf = {
        .active = 0xAA,
        .port = pinmap[pin].gpio_peripheral,
        .pin = pinmap[pin].gpio_pin,
        .clk = gpio_clk,
        .mode = GPIO_Mode_IN,
        .pupd = mode == RISING ? GPIO_PuPd_DOWN : GPIO_PuPd_UP,
        .debounce_time = 0xBBCC,

        .exti_line = pinmap[pin].gpio_pin,
        .exti_port_source = gpio_port_source,
        .exti_pin_source = pinmap[pin].gpio_pin_source,
        .exti_irqn = HAL_Interrupts_Pin_IRQn(pin),
        .exti_irq_prio = HAL_Buttons[BUTTON1].exti_irq_prio,
        .exti_trigger = mode == RISING ? EXTI_Trigger_Rising : EXTI_Trigger_Falling
    };

    BUTTON_Mirror_Persist(&bootloader_conf);
}

static void LED_Mirror_Persist(uint8_t led, led_config_t* conf) {
    const size_t offset = DCT_LED_MIRROR_OFFSET + ((led - LED_MIRROR_OFFSET) * sizeof(led_config_t));
    led_config_t saved_config;
    dct_read_app_data_copy(offset, &saved_config, sizeof(saved_config));

    if (conf) {
        if (saved_config.version == 0xFF || memcmp((void*)conf, (void*)&saved_config, sizeof(led_config_t)))
        {
            dct_write_app_data((void*)conf, offset, sizeof(led_config_t));
        }
    } else {
        if (saved_config.version != 0xFF) {
            memset((void*)&saved_config, 0xff, sizeof(led_config_t));
            dct_write_app_data((void*)&saved_config, offset, sizeof(led_config_t));
        }
    }
}

void HAL_Core_Led_Mirror_Pin_Disable(uint8_t led, uint8_t bootloader, void* reserved)
{
    int32_t state = HAL_disable_irq();
    led_config_t* ledc = HAL_Led_Get_Configuration(led, NULL);
    if (ledc->is_active) {
        ledc->is_active = 0;
        HAL_Pin_Mode(ledc->hal_pin, INPUT);
    }
    HAL_enable_irq(state);

