particle-iot/device-os/hal/src/stm32f2xx/core_hal_stm32f2xx.c
    if (bootloader) {
        LED_Mirror_Persist(led, NULL);
    }
}

void HAL_Core_Led_Mirror_Pin(uint8_t led, pin_t pin, uint32_t flags, uint8_t bootloader, void* reserved)
{
    if (pin > TOTAL_PINS)
        return;

    Hal_Pin_Info* pinmap = HAL_Pin_Map();

    if (!pinmap[pin].timer_peripheral)
        return;

    // NOTE: `flags` currently only control whether the LED state should be inverted
    // NOTE: All mirrored LEDs are currently PWM

    led_config_t conf = {
        .version = 0x01,
        .port = pinmap[pin].gpio_peripheral,
        .pin = pinmap[pin].gpio_pin,
        .hal_pin = pin,
        .hal_mode = AF_OUTPUT_PUSHPULL,
        .pin_source = pinmap[pin].gpio_pin_source,
        .af = 0,
        .tim_peripheral = 0,
        .tim_channel = 0,
        .is_active = 1,
        .is_hal_pin = 1,
        .is_inverted = flags & 1,
        .is_pwm = 1
    };

    int32_t state = HAL_disable_irq();
    HAL_Led_Init(led, &conf, NULL);
    HAL_enable_irq(state);

    if (!bootloader) {
        LED_Mirror_Persist(led, NULL);
        return;
    }

    led_config_t bootloader_conf = {
        .version = 0x01,
        .port = pinmap[pin].gpio_peripheral,
        .pin = pinmap[pin].gpio_pin,
        .clk = Gpio_Peripheral_To_Clk(pinmap[pin].gpio_peripheral),
        .mode = GPIO_Mode_AF,
        .pin_source = pinmap[pin].gpio_pin_source,
        .af = Tim_Peripheral_To_Af(pinmap[pin].timer_peripheral),
        .tim_peripheral = pinmap[pin].timer_peripheral,
        .tim_channel = pinmap[pin].timer_ch,
        .is_active = 1,
        .is_hal_pin = 0,
        .is_inverted = flags & 1,
        .is_pwm = 1
    };

    LED_Mirror_Persist(led, &bootloader_conf);
}

int HAL_Core_Enter_Panic_Mode(void* reserved)
{
    __disable_irq();
    return 0;
}

#if HAL_PLATFORM_CLOUD_UDP

#include "dtls_session_persist.h"
#include "deepsleep_hal_impl.h"
#include <string.h>

retained_system SessionPersistDataOpaque session;

int HAL_System_Backup_Save(size_t offset, const void* buffer, size_t length, void* reserved)
{
	if (offset==0 && length==sizeof(SessionPersistDataOpaque))
	{
		memcpy(&session, buffer, length);
		return 0;
	}
	return -1;
}

int HAL_System_Backup_Restore(size_t offset, void* buffer, size_t max_length, size_t* length, void* reserved)
{
	if (offset==0 && max_length>=sizeof(SessionPersistDataOpaque) && session.size==sizeof(SessionPersistDataOpaque))
	{
		*length = sizeof(SessionPersistDataOpaque);
		memcpy(buffer, &session, sizeof(session));
		return 0;
	}
	return -1;
}


#else

int HAL_System_Backup_Save(size_t offset, const void* buffer, size_t length, void* reserved)
{
	return -1;
}

int HAL_System_Backup_Restore(size_t offset, void* buffer, size_t max_length, size_t* length, void* reserved)
{
	return -1;
}

#endif
